# Brewfile

# Install command-line tools using Homebrew.

# Tap sources
# ================
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# install brew formulae
brew "svn"
brew "ack"
brew "mas"
brew "cocoapods"
brew "gh"
brew "fzf"
brew "git-flow"
brew "bat"
brew "jq"
brew "git"
brew "watchman"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Install formulae
# ================
# install cask formulae:
# install custom powerline fonts for dev and terminal
cask "font-menlo-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-powerline-symbols"
cask "font-fira-code"
cask "font-awesome-terminal-fonts"

cask "1password"
cask "iterm2"
cask "warp"
cask "google-chrome"
cask "cursor"
cask "slack"
cask "discord"
cask "docker"
cask "notion"
cask "spectacle"            # App to easily resize and organize windows
cask "alfred"               # Best productivity tool ever?
cask "firefox"
cask "postman"
cask "spotify"
cask "figma"                # Great app for designing stuff
cask "mounty"               # App to mount NTFS with write mode
