# Brewfile

# Install command-line tools using Homebrew.

# Tap sources
# ================
tap "phinze/cask"
tap "homebrew/cask-fonts"


# Install formulae
# ================
# install cask formulae:
# install custom powerline fonts for dev and terminal
cask "font-menlo-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-powerline-symbols"
cask "font-fira-code"
cask "font-awesome-terminal-fonts"

cask "iterm2"
cask "google-chrome"
cask "visual-studio-code"
cask "slack"
cask "docker"
cask "spectacle"
cask "alfred"
cask "charles"
cask "firefox"
cask "postman"
cask "spotify"
cask "figma"

# install brew formulae
brew "ack"
brew "mas"
brew "cocoapods"
brew "git-flow"
brew "git"
brew "watchman"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Mac App Store 
# ================
mas "WhatsApp Desktop", id: 1147396723
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Xcode", id: 497799835
mas "Dashlane - Password Manager", id: 552383089
mas "NordVPN IKE - Unlimited VPN", id: 1116599239
