# Brewfile

# Install command-line tools using Homebrew.

# Tap sources
# ================
tap "phinze/cask"
tap "homebrew/cask-fonts"


# Install formulae
# ================
# install cask formulae:
# install custom powerline fonts for dev and terminal
cask "font-menlo-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-powerline-symbols"
cask "font-fira-code"
cask "font-awesome-terminal-fonts"

cask "iterm2"
cask "google-chrome"
cask "visual-studio-code"
cask "slack"
cask "docker"
cask "spectacle"            # App to easily resize and organize windows
cask "alfred"               # Best productivity tool ever?
cask "charles"              # Proxy app, very useful for debugging in prod
cask "firefox"
cask "postman"
cask "spotify"
cask "figma"                # Great app for designing stuff
cask "mounty"               # App to mount NTFS with write mode

# install brew formulae
brew "ack"
brew "mas"
brew "cocoapods"
brew "git-flow"
brew "git"
brew "watchman"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
